{
	"session_name": "Session 1 高效 AI 论坛",
	"session_chair": "论坛主席：胥栋宽 (北卡州立大学计算机系 助理教授) &nbsp;&nbsp;&nbsp;&nbsp; 王亚庆 (谷歌研究院研究科学家)",
	"session_desc": "使用自监督学习在大量数据上预训练通用模型，然后在具体任务上对模型进行微调，已经成为解决许多任务的一般范式。最近的许多研究发现，随着预训练模型的参数数量的增加，模型的性能和从少量样本中学习的能力也在增加，但是当通用模型的参数从几百万增加到几百亿时，建立和使用这些模型就变得昂贵和具有挑战性。这些挑战通常分布在参数效率和数据效率之间，前者是指大型模型的训练成本很高，难以部署在内存和计算能力有限的设备上；后者是指大型模型在用于不同的任务时，往往在一个小的标记数据集上过度拟合，导致性能不理想。本次高效人工智能论坛邀请了五位来自国外的优秀学者进行分享，他们将带来高效人工智能领域的最新研究进展。",
	"session_time": [
		"09:00",
		"11:30"
	],
	"session_list": [{
			"time": [
				"09:00",
				"09:30"
			],
			"speaker": {
				"img": "assets/img/speakers/chenbeidi.png",
				"name": "陈贝迪",
				"desc": "FAIR / Meta AI 研究科学家"
			},
			"type": "特邀报告",
			"title": "基于现有硬件的高效稀疏且准确的基础模型训练",
			"desc": "在近几年机器学习中，模型大小和数据量都在快速增长，因此这些大模型的训练需要消耗大量的计算资源。在本次演讲中，我将讲述一些列如何利用模型计算的稀疏性来加速数训练的工作。我们的工作展示了根据当前的硬件性质调整算法可以进一步提高模型训练的效率，而且不会降低准确性。首先我将描述 Pixelated Butterfly 和 Monarch，它们是一个在 GPU 上简单而高效的稀疏模型训练框架。他们使用基于蝶形和低秩矩阵的简单，静态且有结构的稀疏模式，同时考虑到 GPU 在密矩阵相乘的效率。它们的训练速度比密集的 Vision Transformer 和 GPT-2 同类产品快 2.5，而且准确度没有下降。然后我将介绍 AC-SGD，一种在低速网络上高效通信的流水线并行训练框架。基于一个有趣的观察，即模型参数在训练期间变化非常缓慢，AC-SGD 在通信过程中采取了压缩激活与上一次的变化而不是激活本身。它在不牺牲模型质量的情况下，在较慢的网络中以 4.3 倍的速度训练或微调 DeBERTa 和 GPT2-1.5B。最后，我将概述三个未来的研究方向——提高机器学习模型处理以及学习数据的效率、软硬件协同设计和机器学习在基础科学中的应用。"
		},
		{
			"time": [
				"09:30",
				"10:00"
			],
			"speaker": {
				"img": "assets/img/speakers/zhoupeipei.png",
				"name": "周佩佩",
				"desc": "匹兹堡大学助理教授"
			},
			"type": "特邀报告",
			"title": "深度学习加速器芯片的自动调优",
			"desc": "在本次演讲中，我们将从硬件架构，软件栈和自动性能调优三个角度介绍深度学习加速器芯片的设计自动化。"
		},
		{
			"time": [
				"10:00",
				"10:30"
			],
			"speaker": {
				"img": "assets/img/speakers/louqian.png",
				"name": "娄钱",
				"desc": "中佛罗里达大学助理教授"
			},
			"type": "特邀报告",
			"title": "探索高效的、隐私保护的深度学习",
			"desc": "深度学习已经在计算机视觉，自然语言处理，多模态学习等领域展现了强大的性能，但是深度学习巨大的存储计算要求限制了其在个人移动设备上的部署。在保证性能的同时，如何降低存储计算的要求仍然是一大挑战。 另外，部署在云端的深度学习可以利用服务器强大的计算资源给普通用户提供服务，但是用户的数据隐私亟需保护。关于隐私保证的机器学习的研究得到了越来越多的关注。在本次演讲中，我们将会介绍一种共享dictionary的结构来设计轻量级的深度学习模型，这将改善模型在个人设备上的部署。 针对云端机器学习的部署，我们将会介绍隐私保证的机器学习相关的开放问题，以及如何设计一个高效的隐私的机器学习模型。"
		},
		{
			"time": [
				"10:30",
				"11:00"
			],
			"speaker": {
				"img": "assets/img/speakers/liuxiaodong.png",
				"name": "刘晓东",
				"desc": "微软研究院深度学习研究组首席研究员"
			},
			"type": "特邀报告",
			"title": "迈向高效的人工智能模型",
			"desc": "大规模预训练模型的进步极大地改变了人工智能的格局并帮忙我们取得许多突破。但是这些大模型的效率始终有所缺乏。在本次演讲中，我想介绍通过新架构和训练算法（例如模块化和优化）提高模型训练和推理效率的方法。"
		},
		{
			"time": [
				"11:00",
				"11:30"
			],
			"speaker": {
				"img": "assets/img/speakers/yaohuaxiu.png",
				"name": "姚骅修",
				"desc": "斯坦福大学计算机科学博士后学者"
			},
			"type": "特邀报告",
			"title": "使用可操作性机器学习解决分布转移问题",
			"desc": "当在实际应用中部署机器学习算法，我们必须注意分布转移的问题。当测试分布与训练分布不同时，模型性能常被观察到大幅下降。为了解决分布变化，在本次演讲中，我将介绍两种带有一些实例的范例。具体来说，我将首先讨论如何构建对两种分布变化（包括亚群转移和域转移）具有鲁棒性的机器学习模型。然后我将讨论如何使用最少的标记数据有效地使训练模型适应测试分布。还将讨论这个方向的其他挑战和值得研究的未来研究方向。"
		}
	]
}
